[
    {
        "id":"K1",
        "description":"Browser conditions, web standards and specifications.",
        "status": "done"
    },
    {
        "id":"K2",
        "description":"Development methods and work processes, such as agile system development methods.",
        "status": "wip"
    },
    {
        "id":"K3",
        "description":"Methods of quality assurance.",
        "status": "wip"
    },
    {
        "id":"K4",
        "description":"The development process for a frontend developer.",
        "status": "done"
    },
    {
        "id":"K5",
        "description":"How the student can choose work and project methodology according to requirement specifications against set quality requirements in delivery.",
        "status": "wip"
    },
    {
        "id":"K6",
        "description":"How to write efficient frontend code.",
        "status": "wip"
    },
    {
        "id":"K7",
        "description":"Responsive web design and adaptation of graphics to web pages.",
        "status": "done"
    },
    {
        "id":"K8",
        "description":"Development environments, programming languages, guidelines and conditions of HTML5, CSS3 and Javascript.",
        "status": "wip"
    },
    {
        "id":"K9",
        "description":"Overview of other commonly used frontend applications, programming languages and digital tools.",
        "status": "wip"
    },
    {
        "id":"K10",
        "description":"Overview of trends in relation to their own professional role within the frontend industry.",
        "status": "wip"
    },
    {
        "id":"K11",
        "description":"How to create frontend solutions for different user needs and how to build accessible and inclusive applications.",
        "status": "wip"
    },
    {
        "id":"K12",
        "description":"Tools, methods and tips and tricks to make your website look good.",
        "status": "done"
    },
    {
        "id":"S1",
        "description":"Identify and plan out tasks needed to deliver user-interface based websites, services and applications.",
        "status": "done"
    },
    {
        "id":"S2",
        "description":"Create digital solutions with dimensions of different aspects such as user behavior, technical possibilities and limitations.",
        "status": "wip"
    },
    {
        "id":"S3",
        "description":"Identify and solve a complex problem with skills in design and development.",
        "status": "wip"
    },
    {
        "id":"S4",
        "description":"Release and maintain a product. Have skills in programming, accessibility, publishing and debugging frontend code.",
        "status": "done"
    },
    {
        "id":"S5",
        "description":"Communication skills when working in a project with different disciplines both internally and with consultants.",
        "status": "wip"
    },
    {
        "id":"S6",
        "description":"Independently run and complete projects and communicate solutions effectively.",
        "status": "wip"
    },
    {
        "id":"S7",
        "description":"Methods of working online-remote in teams, individually and in client relations.",
        "status": "wip"
    },
    {
        "id":"C1",
        "description":"Independently use adequate technologies required in the professional role of a frontend developer.",
        "status": "future"
    },
    {
        "id":"C2",
        "description":"Collaborating effectively as employees and leaders in project management and implementation.",
        "status": "future"
    },
    {
        "id":"C3",
        "description":"Independently work methodically and flexibly in development projects and sub-processes.",
        "status": "future"
    },
    {
        "id":"C4",
        "description":"Independently monitor work in teams and complete proposed projects.",
        "status": "future"
    },
    {
        "id":"C5",
        "description":"Handle expectations of customers and stakeholders so that it leads to further learning and completion of projects.",
        "status": "future"
    },
    {
        "id":"C6",
        "description":"Applying specialized knowledge within frontend development for continued learning and professional development.",
        "status": "future"
    },
    {
        "id":"FYI",
        "description":"These card-thingies are fetched from a JSON-file in React hooks and looped using mad noob skillz.",
        "status": "done"
    }
]